# Задания:

### 1. На листе A приведены данные о продажах, ответьте на вопросы по этим данным:

На листе A приведены данные о продажах, ответьте на вопросы по этим данным:

а. Минимальная по сумме продажа (номер строки)?

б. Товары какой категории самые продаваемые (в штуках)?

в. Какого товара по сумме было продано меньше всего?

г. Товары какой категории в среднем самые дешёвые?

### 2. На листе B в столбцах A и B приведены наименования товара и цены к ним, так же в столбце C приведены наименования товаров, но цены не указаны. Расставьте цены в стобце D в соответствии с тем, что указано в столбцах A и B

# Выполнение

#### Начнём выполнение первого задания по очереди. Но перед этим, нужно загрузим данные:

In [4]:
# импортируем библиотеку для загрузки excel таблицы
import pandas as pd

In [18]:
# загрузим excel и выведем на экран
data_a = pd.read_excel('Вопросы Excel.xlsx', sheet_name='A')

# вывод первых 5 строк
data_a.head()

  Наименование     Категория  Количество   Цена  Сумма
0    Товар №10  Категория №5           9   5.08    NaN
1     Товар №6  Категория №4           2  16.97    NaN
2    Товар №14  Категория №1           9  21.28    NaN
3     Товар №9  Категория №4           9   7.31    NaN
4    Товар №14  Категория №1           7  16.78    NaN

Теперь можно приступить к выполнению заданий из первого вопроса.

### Задание №1

**а)**

Для того, чтобы найти минимальную по сумме продажу, необходимо заполнить столбец суммы:

In [25]:
# умножим цену на количество
data_a['Сумма'] = data_a['Количество'] * data_a['Цена']

# Найдём минимальную строку
minimum = data_a[data_a['Сумма'] == data_a['Сумма'].min()]

# Выведем на экран полученную строку
minimum

   Наименование     Категория  Количество  Цена  Сумма
21    Товар №11  Категория №2           2   4.6    9.2

Из-за того, что в данной системе отчёт строк начинается от "0", а строка с названиями колонн не считается за строку, поэтому ответ в данном случае 21, а не 23, как в моих ответах в excel.

**Ответ: 21**

**б)**

Для того, чтобы найти самую продаваемую категорю по количеству, следует сделать сводную таблицу по категориям и количествам, взяв агрегатную функцию в виде суммы:

In [39]:
# сводная таблица по сумме
pivot_sum = pd.pivot_table(data_a, values='Количество', columns='Категория', aggfunc='sum')

# вывод максимальной суммы товараё на экран
pivot_sum

Категория,Категория №1,Категория №2,Категория №3,Категория №4,Категория №5
Количество,72,32,40,37,53

Очевидно, что самая продаваемая категория - это первая категория.

**Ответ: Категория №1**

**в)**

Так как один товар может быть разной категории, следует найти и сделать сводную таблицу по категориям, товарам и сумме, используя функцию суммы:

In [74]:
# сводная таблица по сумме
pivot_sum_product = pd.pivot_table(data_a, values='Сумма', index='Наименование', aggfunc='sum')

# вывод самого убыточного товара товара 
minimum = pivot_sum_product[pivot_sum_product['Сумма'] == pivot_sum_product['Сумма'].min()]
minimum

              Сумма
Наименование
Товар №3      20.56

В данном случае, Товар №3 принадлежит только одной категории - категории №1. По этой причине, в ответ можно просто написать номер товара.

**Ответ: Товар №3 **

**б)**

Для того, чтобы найти самую дешёвую категорю, следует сделать сводную таблицу по цене и категориям, взяв агрегатную функцию в виде среднего:

In [81]:
# сводная таблица по сумме
pivot_sum = pd.pivot_table(data_a, values='Цена', columns='Категория', aggfunc='mean')

# вывод cредней суммы по категориям
pivot_sum

Категория,Категория №1,Категория №2,Категория №3,Категория №4,Категория №5
Цена,19.503,21.376,30.03,24.806,18.657778

Очевидно, что самая дешёвая в среднем категория - это пятая категория.

**Ответ: Категория №5**

### Задание №2

Начнём выполнение второго задания. Но перед этим, нужно загрузим данные:

In [86]:
# загрузим excel и выведем на экран
data_b = pd.read_excel('Вопросы Excel.xlsx', sheet_name='B')

# вывод первых 5 строк
data_b.head()

  Наименование  Цена Наименование.1  Цена.1
0   Товар №001  8.77     Товар №032     NaN
1   Товар №002  8.70     Товар №095     NaN
2   Товар №003  8.67     Товар №012     NaN
3   Товар №004  4.22     Товар №062     NaN
4   Товар №005  9.41     Товар №011     NaN

Как можно наблюдать, при загрузке одинаковые названия колонн система нумерует, чтобы не было путанецы. Для удобства, разобьём их в две разные таблички и переименуем проиндексированные колонки:

In [102]:
# записали в разные переменные
data_b_first = data_b[['Наименование', 'Цена']].dropna()
data_b_second = data_b[['Наименование.1']]

# переименовали прономерованные колонны
data_b_second.rename(columns = {'Наименование.1':'Наименование'}, inplace = True )

Теперь можно объеденить таблицы - как ВПР в экселе:

In [103]:
# объеденение двух таблиц
data_b_second = pd.merge(data_b_second,
                         data_b_first,
                         on ='Наименование',
                         how ='left')
# вывод на экран
data_b_second

     Наименование  Цена
0      Товар №032  9.64
1      Товар №095  9.60
2      Товар №012  7.92
3      Товар №062  9.45
4      Товар №011  9.18
...           ...   ...
1185   Товар №080  7.76
1186   Товар №035  4.40
1187   Товар №022  7.12
1188   Товар №088  9.77
1189   Товар №056  7.64

[1190 rows x 2 columns]

Сравним две таблички:

In [106]:
data_b_first.head(15)

   Наименование   Цена
0    Товар №001   8.77
1    Товар №002   8.70
2    Товар №003   8.67
3    Товар №004   4.22
4    Товар №005   9.41
5    Товар №006  10.00
6    Товар №007   7.41
7    Товар №008   8.79
8    Товар №009   9.98
9    Товар №010   3.89
10   Товар №011   9.18
11   Товар №012   7.92
12   Товар №013   9.74
13   Товар №014   7.26
14   Товар №015   8.50

**Как можно заметить, объединение прошло успешно.**